{"scoring":null,"notes":"","legend":"Little Barney just got a new toy cube set from his parents. His set contains $n$ identical cubes. Barney immediately started building various objects with these cubes.\r\n\r\nThe latest thing Barney built is a \\textit{stair}. A stair consists of one or more towers of cubes, where the heights of towers are \\textit{non-increasing} from left to right. In the following picture, you can see three different shapes with $12$ cubes each. The first two are stairs and the third one is not a stair.\r\n\r\n\\vspace*{-5pt}\r\n\r\n\\begin{center}\r\n\\includegraphics{figure-1}\r\n\\end{center}\r\n\r\n\\vspace*{-5pt}\r\n\r\nBarney noticed that for some stairs you can turn your head 90 degrees to the right and you will see the same stair, but reversed! He calls such stairs \\textit{symmetric}. For example, the first stair above is symmetric, but the second one is not. Formally, a stair is symmetric if and only if when you reflect the picture over the $x = y$ line, you get the same stair (where the $x$-axis is horizontal and oriented to the right, and the $y$-axis is vertical and oriented upwards).\r\n\r\n\\vspace*{-5pt}\r\n\r\n\\begin{center}\r\n\\includegraphics{figure-2}\r\n\\end{center}\r\n\r\n\\vspace*{-5pt}\r\n\r\nBarney wants to build a symmetric stair using all of his $n$ cubes. Show him how to do it!","authorLogin":"avasilyev","language":"english","timeLimit":3000,"output":"If there is no symmetric stair with $n$ cubes, output a single integer $-1$.\r\n\r\nOtherwise, in the first line, output one integer $m$~--- the number of rows and columns in the picture of the stair ($1 \\le m \\le 100$). Then, output $m$ lines describing the stair. Each line must contain exactly $m$ characters `\\texttt{o}' (a lowercase English letter) or `\\texttt{.}', where `\\texttt{o}' describes a cell with a cube, and `\\texttt{.}' describes an empty cell. There must be exactly $n$ `\\texttt{o}' characters in total. The cell in the bottom left corner must contain a cube. If there is more than one solution, output any of them.\r\n","inputFile":"stdin","outputFile":"stdout","input":"The single line of the input contains an integer $n$~--- the number of cubes at Barney's disposal ($1 \\le n \\le 100$).","authorName":"Artem Vasilyev","sampleTests":[{"output":"3\r\n...\r\no..\r\noo.\r\n","input":"3\r\n"},{"output":"5\r\no....\r\nooo..\r\noooo.\r\noooo.\r\nooooo","input":"17\r\n"}],"name":"Building a Stair","interaction":null,"memoryLimit":536870912,"tutorial":""}