{"scoring":null,"notes":"In this example, all single-color LED-led paths are not longer than one street (and therefore not longer than 42 streets), which is absolutely OK according to the health department.","legend":"In a large city there are $n$ junctions and $m$ one-way streets connecting those junctions. It is known that one can't walk along the streets infinitely, as there is no directed cycle of streets in the city.\r\n\r\nThe tourism department has decided to install colored illumination using the LED (light-emitting diode) technology. Each street is to be illuminated with either red~(\\t{R}), green~(\\t{G}), or blue~(\\t{B}) color.\r\n\r\nThe official city maps for tourists will indicate the selected colors. All continuous paths illuminated by the same color will be suggested for walking and sightseeing. As LEDs will lead people along beautiful ways, these paths will be called LED-led paths.\r\n\r\nThe health department says that if there is a very long single-color LED-led path, some tourists might overestimate their strength, walk for too long, get too tired, and dislike the city.\r\n\r\nPropose a three-color illumination plan in which no single-color LED-led path consists of more than 42~streets.","authorLogin":"dvorkin","language":"english","timeLimit":3000,"output":"For each street, in the order of input, output its color on a separate line~--- a single letter \\t{R}, \\t{G}, or \\t{B}.","inputFile":"stdin","outputFile":"stdout","input":"The first line of the input contains two integers $n$ and $m$~--- the number of junctions and streets, respectively ($2 \\le n \\le 50\\,000$; $1 \\le m \\le 200\\,000$).\r\n\r\nEach of the following $m$ lines contains two integers $u_i$ and $v_i$, denoting a one-way street from junction $u_i$ to junction $v_i$ ($1 \\le u_i, v_i \\le n$; $u_i \\neq v_i$).\r\n\r\nThe given city is guaranteed to be acyclic. Each pair of junctions is connected by at most one street.","authorName":"Mikhail Dvorkin","sampleTests":[{"output":"B\r\nR\r\nG\r\nR\r\nB\r\nG\r\n","input":"5 6\r\n5 3\r\n3 1\r\n1 2\r\n2 4\r\n5 2\r\n3 4\r\n"}],"name":"LED-led Paths","interaction":null,"memoryLimit":536870912,"tutorial":""}