{"scoring":null,"notes":"","legend":"John is doing physics practice at school. Today he is studying the law of communicating vessels. This law states that if we have a set of communicating containers with a homogeneous liquid, when the liquid settles, it balances out to the same level in all of the containers regardless of their shape and volume.\r\n\r\nIn the lab, John has a set of $n$ cylindrical vessels with a base area of one square decimeter and a height that we consider to be infinite. The vessels are numbered from $1$ to $n$, and vessels $i$ and $i+1$ are communicating via a very thin bridge at a height of $h_i$ decimeters. All these heights are pairwise distinct.\r\n\r\nThe practice work contains $t$ independent experiments. In each experiment, all vessels are initially empty. In the $i$-th experiment, water is slowly put into vessel $a_i$, and the experiment finishes when any amount of water appears in vessel $b_i$. \r\nThe result of the experiment is the total volume of water put into vessel $a_i$, measured in liters (or, equivalently, cubic decimeters).\r\n\r\nNote that the law of communicating vessels can only be applied to vessels $i$ and $i+1$ when the water level is at least $h_i$ in both of them. Until then, if the water level reaches $h_i$ in just one of them, it stays constant and any excess water coming into this vessel flows through the bridge into the other one.\r\n\r\nHelp John check his results!","authorLogin":"pkunyavskiy","language":"english","timeLimit":3000,"output":"For each experiment, in the order of input, output a single integer~--- the required volume of water, in liters. ","inputFile":"stdin","outputFile":"stdout","input":"The first line of the input contains an integer $n$~--- the number of vessels ($2 \\le n \\le 2 \\cdot 10^5$). \r\n\r\nThe second line contains $n - 1$ integers $h_1, h_2, \\dots, h_{n-1}$~--- the heights of communication bridges between consecutive vessels, in decimeters ($1 \\le h_i \\le 10^9$). These heights are pairwise distinct.\r\n\r\nThe third line contains an integer $t$~--- the number of experiments ($1 \\le t \\le 2 \\cdot 10^5$).\r\n\r\nEach of the following $t$ lines contains two integers $a_i$ and $b_i$~--- the numbers of the starting vessel and the target vessel in the $i$-th experiment ($1 \\le a_i \\le n$; $1 \\le b_i \\le n$; $a_i \\neq b_i$).","authorName":"Pavel Kunyavskiy","sampleTests":[{"output":"25\r\n18\r\n14\r\n12\r\n","input":"6\r\n1 4 2 3 5\r\n4\r\n1 6\r\n6 1\r\n2 5\r\n5 2\r\n"}],"name":"Joined Vessels","interaction":null,"memoryLimit":536870912,"tutorial":""}