{"scoring":null,"notes":"","legend":"Nathan owns a shop that sells souvenir nunchucks with unique design. Nunchucks is a traditional martial arts weapon consisting of two sticks connected with a chain. In Nathan's design, each stick is inlayed with $n$ gemstones arranged in a row. These gemstones are either quartz or onyx, and they create a nice black-and-white pattern. For aesthetics reasons, Nathan sells only nunchucks with exactly $k$ onyxes on both sticks in total. For example, here is one of the possible designs for $n=4$ and $k=5$.\r\n\r\n\\begin{center}\r\n\\includegraphics{pic1.eps}\r\n\\end{center}\r\n\r\nRecently Nathan decided that it will be good to be able to sell nunchucks with every possible design. But that will require him to have nunchucks with all possible designs in the storage, and the number of possible designs is huge! \r\n\r\nThus, Nathan decided to compromise. He will have a number of sticks in his storage. When a customer orders some design, Nathan will take two sticks from the storage and combine them with a chain. Sticks are symmetrical, and Nathan can connect the chain to any end of the stick. For example, if $n=3$ and $k=2$, and Nathan has these sticks in the storage:\r\n\r\n\\begin{center}\r\n\\includegraphics{pic2.eps}\r\n\\end{center}\r\n\r\nThen he can make nunchucks of any possible design. For example, if the customer asks for nunchucks of this design:\r\n\r\n\\begin{center}\r\n\\includegraphics{pic3.eps}\r\n\\end{center}\r\n\r\nThen Nathan can make it from sticks 1 and 3.\r\n\r\nNow Nathan wonders: what is the minimum number of sticks he should have in the storage to be able to make nunchucks of any possible design? Help him find this number.","authorLogin":"pashka","language":"english","timeLimit":2000,"output":"Output one integer: the minimum number of sticks Nathan should have in the storage.","inputFile":"stdin","outputFile":"stdout","input":"The input contains two integers $n$ and $k$ ($1\\le n\\le 50$; $0\\le k\\le 2\\cdot n$).","authorName":"Pavel Mavrin","sampleTests":[{"output":"7\r\n","input":"3 2\r\n","inputFile":"example.01","outputFile":"example.01.a"},{"output":"3\r\n","input":"4 1\r\n","inputFile":"example.02","outputFile":"example.02.a"},{"output":"2\r\n","input":"5 0\r\n","inputFile":"example.03","outputFile":"example.03.a"},{"output":"626155273417404\r\n","input":"50 50\r\n","inputFile":"example.04","outputFile":"example.04.a"}],"name":"Nunchucks Shop","interaction":null,"memoryLimit":536870912,"tutorial":""}