{"scoring":null,"notes":"In the first example, there is no randomness. The first two matches are always exciting, the third one is always not.\r\n\r\nIn the second example, the first match is exciting. There are two possible orders. In case the semifinal match comes before the final match, both matches are exciting. In the other case, the semifinal will not be exciting as Hedy watches it after the final. The expected value is $1 + \\frac 12 (2 + 1) = 2.5$.","legend":"It is year 2030. Professional coin flipping has become the most popular game on the Internet. Latest coin flipping World Championship gathered the record amount of participants from around the world! There are $2^k$ participants, competing in a single-elimination tournament for the title of the Coin Flipping World Champion. For simplicity, we will refer to participants as numbers from $1$ to $2^k$.\r\n\r\nIn the first stage, participants are split into pairs: 1 against 2, 3 against 4, \\ldots $2^k - 1$ against $2^k$. The winner of each match advances to the next stage. Every next stage goes on similarly: remaining participants are sorted by their number, then split into pairs to play their matches. The last $k$-th stage is just one match that crowns the world's best coin flipper. All participants' coin-flipping skills are almost identical to each other: in a match with any two participants, the probability of one of them winning is exactly $\\frac 12$.\r\n\r\n\\begin{figure}[h!]\r\n\\begin{center}\r\n\\includegraphics{tournament.1}\r\n\\end{center}\r\n\\caption*{An example of a single-elimination tournament with 8 participants. S$X$M$Y$ is a shorthand for the $Y$-th match of the $X$-th stage.}\r\n\\end{figure}\r\n\r\nHedy missed the live broadcast of the tournament, so she's going to watch all the recordings after the fact. She already knows the list of all participants (and their numbers), but doesn't know any match outcomes. Friends suggested Hedy $n$ matches to watch first (without spoiling the result, of course!). First she is going to watch these $n$ matches in a specific order, then watch all the remaining matches in random order.\r\n\r\nHedy considers a match \\textit{exciting} if she doesn't know the winner of that match before watching it. For example, after watching the final, both semifinals will not be exciting for her, because she will have already seen the semifinals winners competing in the final. \r\n\r\nFind the expected number of exciting matches, averaged over all possible tournament outcomes and watch orders.","authorLogin":"avasilyev","language":"english","timeLimit":2000,"output":"Print a single real number~--- the expected number of exciting matches. The absolute or relative error should not exceed $10^{-9}$.","inputFile":"stdin","outputFile":"stdout","input":"The first line of the input contains two integers $k$ and $n$ ($1 \\le k \\le 30$; $0 \\le n \\le \\min(2^k - 1, 10^5)$).\r\nNext $n$ lines describe the suggested matches in order Hedy is going to watch them. Each line contains two integers $s_i$ and $m_i$, the stage and the number of the match within that stage ($1 \\le s_i \\le k$; $1 \\le m_i \\le 2^{k-s_i}$; all pairs $(s_i, m_i)$ are distinct).\r\n","authorName":"Artem Vasilyev","sampleTests":[{"output":"2.0\r\n","input":"2 3\r\n1 1\r\n2 1\r\n1 2\r\n","inputFile":"example.01","outputFile":"example.01.a"},{"output":"2.5\r\n","input":"2 1\r\n1 1\r\n","inputFile":"example.02","outputFile":"example.02.a"},{"output":"2.25\r\n","input":"3 2\r\n3 1\r\n1 4\r\n","inputFile":"example.03","outputFile":"example.03.a"},{"output":"6.833333333333333\r\n","input":"4 0\r\n","inputFile":"example.04","outputFile":"example.04.a"}],"name":"Heroes of Coin Flipping","interaction":null,"memoryLimit":536870912,"tutorial":""}