{"scoring":null,"notes":"In the first example, Kolya will remove keyboards 4 and 5 in any order, and Kostya will remove keyboards 1 and 2 in any order. Thus, keyboard 3 will be chosen.\r\n\r\nIn the second example, both of them like keyboard 1, so they will remove all other keyboards in any order.\r\n\r\nIn the third example, the only optimal move for Kolya is to remove keyboard 1 on his turn. Kostya will choose between keyboards 2 and 3, and since keyboard 3 is better for him, he will remove keyboard 2.\r\n\r\nIn the fourth example, a simple search through all possible moves shows that Kolya cannot force keyboard 4 to be chosen, and the answer is 1.","legend":"Famous young programmers Kolya and Kostya are preparing for the upcoming team contest. One of the important decisions they need to make is to pick a keyboard they both are comfortable with. To reach a consensus they have decided to use the following procedure.\r\n\r\nThere are $n$ keyboards numbered from 1 to $n$. Initially, the set of candidates contains all $n$ keyboards. The programmers take turns, Kolya goes first. On his turn, the programmer removes one keyboard from the set. The last keyboard remaining in the set will be chosen for the contest.\r\n\r\nEach programmer has prepared a list containing all $n$ keyboards, sorted from the one he likes the most to the one he likes the least. Both Kolya and Kostya want to minimize the position of the chosen keyboard in their list. They both know the lists of each other.\r\n\r\nFind the keyboard that will be chosen if both programmers play optimally, and all optimal first moves for Kolya~--- keyboards he can remove on his first turn to guarantee the best possible result for himself.","authorLogin":"pashka","language":"english","timeLimit":3000,"output":"In the first line output one integer~--- the number of the chosen keyboard. In the second line output the number of optimal first moves for Kolya. In the third line output these moves in increasing order.","inputFile":"stdin","outputFile":"stdout","input":"The first line of the input contains an integer $n$~--- the number of keyboards ($2 \\le n \\le 100$). The second line contains $n$ distinct integers between 1 and $n$, inclusive~--- the numbers of keyboards in Kolya's list, in the order from the one he likes the most to the one he likes the least. The third line contains Kostya's list in the same format.","authorName":"Pavel Mavrin","sampleTests":[{"output":"3\r\n2\r\n4 5 \r\n","input":"5\r\n1 2 3 4 5\r\n5 4 3 2 1\r\n"},{"output":"1\r\n3\r\n2 3 4 \r\n","input":"4\r\n1 2 3 4\r\n1 3 2 4\r\n"},{"output":"3\r\n1\r\n1 \r\n","input":"3\r\n3 1 2\r\n1 3 2\r\n"},{"output":"1\r\n3\r\n2 3 4 \r\n","input":"4\r\n4 1 3 2\r\n1 3 4 2\r\n"}],"name":"Keyboard Consensus","interaction":null,"memoryLimit":536870912,"tutorial":""}