{"scoring":null,"notes":"In the first example, the guess can be correct. For example, you could have emails with subjects ``\\t{hello}'', ``\\t{Re: hello}'', ``\\t{Re: Re: hello}'', ``\\t{Re: Re: Re: hello}'', ``\\t{Re: Re: Re: Re: hello}'', ``\\t{world}'', and ``\\t{Re:~world}''.\r\n\r\nIn the second example, the guess is incorrect since there had to be at least three emails in the chain of ``\\t{pleasehelp}'' and at least one email in the chain of ``\\t{me}''.","legend":"You have an account on ICPCorrespondence.com. This is an email service where emails are grouped into chains by their subject as follows.\r\n\r\nThe first email in every chain has a non-empty subject consisting of lowercase English letters. Every succeeding email in the chain has a subject consisting of ``\\t{Re: }'' followed by the subject of the previous email.\r\n\r\nFor example, if the first email in the chain has subject ``\\t{subj}'',\r\nthen the second email has subject ``\\t{Re: subj}'', the third one has subject ``\\t{Re: Re: subj}'', and so on. Formally, the subject of the $k$-th email in the chain consists of ``\\t{Re: }'' repeated $k - 1$ times followed by the subject of the first email in the chain.\r\n\r\nIn your mailbox, you had one or more chains of emails with unique subjects. You never removed any emails from your mailbox.\r\n\r\nUnfortunately, one day ICPCorrespondence.com was attacked by hackers. As a result of this attack, some emails were removed from the server, while the remaining emails were shuffled.\r\n\r\nYou are not sure how many emails you had in the mailbox before the attack, but you guess that this number is $n$. Can you check whether this guess can be correct?\r\n","authorLogin":"Aksenov239","language":"english","timeLimit":3000,"output":"If your guess about the number of emails in your mailbox prior to the attack can be correct, output a single word ``\\t{YES}''. Otherwise, output a single word ``\\t{NO}''.","inputFile":"stdin","outputFile":"stdout","input":"The first line of the input contains two integers $n$ and $k$~--- the number of emails that you think were in the mailbox before the attack, and the number of emails left after the attack, respectively ($1 \\leq k \\leq n \\leq 100$).\r\n\r\nThe following $k$ lines contain subjects of the emails left in your mailbox, one per line. The subject of each email consists of ``\\t{Re: }'' repeated zero or more times, followed by at least one and no more than $10$ lowercase English letters. The length of each subject does not exceed $500$. All email subjects are pairwise distinct.","authorName":"Vitalik Aksenov","sampleTests":[{"output":"YES\r\n","input":"7 3\r\nRe: Re: Re: hello\r\nRe: world\r\nhello\r\n"},{"output":"NO\r\n","input":"3 2\r\nRe: Re: pleasehelp\r\nme\r\n"}],"name":"Email Destruction","interaction":null,"memoryLimit":536870912,"tutorial":""}